list1 = [1, 3, 5, 7]
list2 = [2, 4, 6, 7]
def damn(list1, list2):
    for a in list1:
        for b in list2:
            if a == b:
                print ("True")
            else:
                print ("False")
print(damn(list1, list2))
# Отче наш, сущий на небесах! 
# Да святится имя Твое; да приидет Царствие Твое; 
# да будет воля Твоя и на земле, как на небе; 
# хлеб наш насущный дай нам на сей день; 
# и прости нам долги наши, как и мы прощаем должникам нашим; 
# и не введи нас в искушение, но избавь нас от лукавого. 
# Ибо Твое есть Царство и сила и слава во веки.